{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.20.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}, "outputs": {"tf.__operators__.add": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/reshape/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/decoder/reshape/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/decoder/tf.math.truediv/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/tf.__operators__.add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["input_2", "StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/mul_1", "StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/decoder/batch_normalization_5/batchnorm/add_1", "StatefulPartitionedCall/decoder/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/decoder/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/reshape/Shape", "StatefulPartitionedCall/decoder/reshape/strided_slice/stack", "StatefulPartitionedCall/decoder/reshape/strided_slice/stack_1", "StatefulPartitionedCall/decoder/reshape/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/reshape/strided_slice", "StatefulPartitionedCall/decoder/reshape/Reshape/shape/1", "StatefulPartitionedCall/decoder/reshape/Reshape/shape/2", "StatefulPartitionedCall/decoder/reshape/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/decoder/dense_1/BiasAdd", "StatefulPartitionedCall/decoder/reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/reshape/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose/stack", "StatefulPartitionedCall/decoder/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/reshape/Reshape"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_1/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_1/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_1/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/conv2d_transpose/Relu"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_1/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_1/Relu", "StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_2/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_2/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_2/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/batch_normalization_6/FusedBatchNormV3"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_2/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_3/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_3/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_3/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_3/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_3/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/conv2d_transpose_2/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_3/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_3/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_3/Relu", "StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3/Mul", "StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_4/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_4/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_4/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/batch_normalization_7/FusedBatchNormV3"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_4/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_4/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_5/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_5/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/conv2d_transpose_4/Relu"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_5/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_5/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_5/Relu", "StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3/Mul", "StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_6/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_6/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/batch_normalization_8/FusedBatchNormV3"], "attr": {"padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_6/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_6/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_6/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_7/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_7/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/conv2d_transpose_6/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_7/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_7/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_7/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_8/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_8/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/conv2d_transpose_7/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_8/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_8/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/tf.math.truediv/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_8/Tanh", "ConstantFolding/StatefulPartitionedCall/decoder/tf.math.truediv/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/tf.__operators__.add/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/decoder/tf.math.truediv/truediv", "StatefulPartitionedCall/decoder/tf.__operators__.add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/decoder/tf.__operators__.add/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1205}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_8/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 1, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_7/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_6/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 8, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_4/strided_slice/stack", 