{
	"name": "Геодезия",
    "1 семестр": [
        "1. Предмет и задачи геодезии. Единицы измерений, применяемые в геодезии.",
        "2. Понятие о форме и размерах Земли.",
        "3. Влияние кривизны Земли на горизонтальные расстояния. Вывод.",
        "4. Влияние кривизны Земли на вертикальные расстояния. Вывод.",
        "5. Понятие о плане и карте. Масштабы топографических карт России",
        "6. Условные знаки топографических карт и планов. Привести примеры на карте.",
        "7. Основные понятия о координатах точек земной поверхности",
        "8. Рамки листа топографической карты. Система высот, принятая в геодезии. ",
        "9. Масштабы топографических карт и планов.   Точность масштаба. ",
        "10. Разграфка и номенклатура топографических карт и планов разных масштабов. ",
        "11. Цифровая номенклатура карт России. ",
        "12. Зональная система плоских прямоугольных координат (проекция Гаусса–Крюгера) Достоинства и недостатки данной системы. (географические, прямоугольные, полярные и биополярные координаты). Преобразованные координаты.",
        "13. Понятие об ориентировании линий. ",
        "14. Ориентирование по географическому меридиану точки. Истинный азимут.",
        "15. Ориентирование по осевому меридиану зоны. Дирекционный угол.",
        "16. Сближение меридианов. Вывод ",
        "17. Ориентирование по магнитному меридиану точки. Магнитный азимут. ",
        "18. Румбы линий",
        "19. Ориентирование топографической карты на местности.  Ориентирование топографической карты с помощью буссоли. ",
        "20. Передача дирекционного угла на предыдущую сторону через угол между предыдущей и последующей сторонами.",
        "21. Прямая геодезическая задача. Вывод. ",
        "22. Обратная геодезическая задача. Вывод. ",
        "23. Рельеф. Основные формы рельефа. Характерные точки и линии рельефа. Показать на карте. ",
        "24. Сущность изображения рельефа местности горизонталями.",
        "25. Свойства горизонталей.",
        "26. Определение уклонов линии местности на карте. ",
        "27. Высота сечения рельефа на картах различных масштабов. ",
        "28. Геодезическое измерение, результат измерения, методы и условия измерений. Равноточные и неравноточные измерения",
        "29. Принцип измерения горизонтального угла",
        "30. Свойства случайных погрешностей измерений. ",
        "31. Арифметическое среднее. Вывод. ",
        "32. Средняя квадратическая погрешность (СКП). СКП самой СКП. Предельная погрешность. Относительная погрешность.",
        "33. Средняя квадратическая погрешность простой арифметической средины. Вывод.",
        "34. Формула Бесселя. Вывод",
        "35. Теодолит 3Т5КП, его составные части.",
        "36. Классификация теодолитов",
        "37. Уровни. Цена деления, чувствительность уровня. ",
        "38. Зрительные трубы и их установка. Параллакс сетки нитей.",
        "39. Поверки и юстировка теодолита 3Т5КП. ",
        "40. Поверка устойчивости штатива и подставки.",
        "41. Место нуля вертикального круга. Измерения вертикального угла. ",
        "42. Измерения горизонтального угла. ",
        "43. Влияние коллимационной ошибки на измеряемое направление линии. Вывод.",
        "44. Влияние наклона оси вращения зрительной трубы на измеряемое направление линии. Вывод. ",
        "45. Принцип измерения расстояний оптическими дальномерами. Определение  расстояния нитяным дальномером. ",
        "46. Нитяной дальномер в зрительной трубе с наружным фокусированием. Вывод. ",
        "47. Приведение к горизонту наклонных расстояний, измеренных нитяным дальномером с вертикальной рейкой. Вывод. ",
        "48. Нитяной дальномер в зрительных трубах с внутренним фокусированием. Вывод.",
        "49. Определение поправки «Р» в нитяной дальномер зрительной трубы с внутренним фокусированием.",
        "50. Увеличение, поле зрения, точность визирования и яркость зрительной трубы."
    ],
	"2 семестр": [
		"1. Способы измерения превышения",
        "2. Сущность и виды геометрического нивелирования",
        "3. Последовательное нивелирование",
        "4. Влияние кривизны Земли и вертикальной рефракции на результаты нивелирования",
        "5. Классификация нивелиров",
        "6. Точные нивелиры. Маркировка приборов. Нивелир 4Н3КЛ (Схема нивелира и компенсатора).",
        "7. Нивелирные рейки. Поверки и исследование реек РН-3",
        "8. Исследование зрительной трубы нивклира 4Н-3КЛ",
        "9. Внешний осмотр. Поверки и юстировки нивелиров 4Н-3КЛ. Способ двойного нивелирования вперёд. Способ сочетания нивелирования из середины с нивелированием вперед. Способ нивелирования с различными плечами",
        "10. Полевые измерения при нивелировании IV класса",
        "11. Исследование постоянства положения визирной оси при фокусировании нивелира",
        "12. уравнивание одиночного нивелирного хода",
        "13. Понятие о государственной геодезической сети РФ. Нивелирные знаки.",
        "14. Государственные и специальные геодезические сети",
        "15. Точность тригонометрического нивелирования. СКП превышения mh",
        "16. Точность тригонометрического нивелирования. Допустимое расхождение между превышениями двух точек, измеренными в прямом и обратном направлениях",
        "17. Точность тригонометрического нивелирования. Предельная ошибка суммы средних превышений высотного хода",
        "18. Классификация ошибок нивелирования. Погрешность, вызванная несоблюдением главного условия",
        "19. Классификация ошибок нивелирования. Погрешность за счёт неправильного хода фокусирующей линзы",
        "20. Классификация ошибок нивелирования. Влияние остаточного наклона вертикальной оси прибора",
        "21. Классификация ошибок нивелирования. Погрешность за наклон реек",
        "22. Формула тригонометрического нивелирования. Вывод",
        "23. Понятие о теодолитном и тахеометрическом ходах, их сходство, различие и назначение",
        "24. Привязка теодолитных и тахеометрических ходов к пунктам опорной геодезической основы",
        "25. Полевые работы по созданию съёмочной геодезической сети теодолитными или тахеометрическими ходами",
        "26. Проложение теодолитного хода",
        "27. Порядок работы на пункте тахеометрического хода",
        "28. Увязка горизонтальных углов и вычисление дирекционных углов тахеометрического хода. Вывод",
        "29. Разомкнутый ход. Вычисление прямоугольных координат пунктов тахеометрического хода. Вывод",
        "30. Сомкнутый тахеометрический ход. Вывод",
        "31. Увязка превышений и вычисление отметок пунктов тахеометрического хода. Вывод",
        "32. Теодолитная и тахеометрическая съёмки. Общие положения",
        "33. Тахеометрическая съёмка ситуации и рельефа местности. Порядок работы на станции при съемке ситуации и рельефа",
        "34. Абрис тахеометрической съёмки",
        "35. Построение плана тахеометрической съёмки. Построение координатной сетки",
        "36. Построение плана тахеометрической съёмки. Нанесение по координатам точек тахеометрического хода и накладка пикетных точек",
        "37. Построение плана тахеометрической съёмки. Изображение рельефа и интерполяция",
        "38. Построение плана тахеометрической съёмки. Проверка и корректура вычерченного плана",
        "39. Исследование теодолита 3Т5КП",
        "40. Поверки и юстировка теодолита 3Т5КП",
        "41. Определение поправки «P» в нитяной дальномер зрительной трубы с внутренним фокусированием"
	]
}