{
	"name": "Геоморфология",
	"Случайный вопрос": [
		"1. Геология, геоморфология, инженерная геология. Задачи и методы исследования.",
		"2. Общее строение Земли (атмосфера, гидросфера, внутреннее строение Земли, литосфера, биосфера).",
		"3. Химический состав и строение земной коры. Типы земной коры. Кларки.",
		"4. Минералы и горные породы. Классификации и происхождение. Их влияние на интенсивность развития геоморфологических процессов.",
		"5. Аномальные геофизические поля и их использование для поисков и разведки полезных ископаемых.",
		"6. Рельеф Земли. Геотектуры, морфоструктуры, морфоскульптуры. Формы и элементы форм рельефа. Типы рельефа. Гипсографичкская кривая.",
		"7. Геохронология. Методы определения возраста горных пород.",
		"8. Фации и формации. Фациальные и формационные анализы. Метод актуализма.",
		"9. Геологические, тектонические и инженерно-геологические карты.",
		"10. Эндогенные и экзогенные процессы и их влияние на рельеф.",
		"11. Магматические процессы и их влияние на рельеф. Формы магматических тел.",
		"12. Вулканические процессы и их влияние на рельеф. Типы вулканов.",
		"13. Метаморфические процессы и их влияние на рельеф. Типы метаморфизма.",
		"14. Сейсмические процессы, цунами. Шкала бальности и магнитуд. Прогнозирование землетрясений.",
		"15. Тектонические процессы и их влияние на рельеф. Типы тектонических движений. Тектонические циклы. Несогласное залегание.",
		"16. Складчатые дислокации и их влияние на рельеф. Формы складок.",
		"17. Разрывные дислокации и их влияние на рельеф. Типы разрывных нарушений.",
		"18. Платформы (континентальные, океанские). Рельеф и возраст платформ.",
		"19. Подвижные пояса (рифтогены, вулканические дуги, орогены, геосинклинали, периконтинентальные прогибы).",
		"20. Геотектонические гипотезы мобилизма и фиксизма.",
		"21. Современные движения земной поверхности. Методы изучения. Парадокс скоростей.",
		"22. Новейшие движения земной коры и их влияние на рельеф. Карты неотектоники.",
		"23. Молодые движения земной коры. Гляциоизостатические движения.",
		"24. Антропогенные движения земной коры",
		"25. Аэрокосмические методы исследований. Свойства космических снимков.",
		"26. Процессы выветривания горных пород. Коры выветривания. Элювий.",
		"27. Формы рельефа, образованные плоскостным стоком воды. Делювий.",
		"28. Формы рельефа, образованные временными русловыми потоками воды. Типы поперечных профилей оврагов. Конусы выноса. Пролювий.",
		"29. Речные системы. Режимы рек. Гидрограф. Расход воды, объём стока, модуль стока, слой стока.",
		"30. Формы рельефа, обусловленные постоянными русловыми потоками (флювиальные формы рельефа). Аллювий.",
		"31. Типы речных долин и их происхождение.",
		"32. Абразионные процессы. Формы абразионного рельефа. Морские тераасы.",
		"33. Типы морских берегов и их происхождение.",
		"34. Материковые покровные ледники и их влияние на рельеф. Ледниковые и межледниковые эпохи. Морена.",
		"35. Горные ледники и их влияние на рельеф. Типы моренных гряд."
	]
}


